{
  "basics": {
    "name": "Patrick Woodburn",
    "label": "Software Engineer",
    "email": "pat@patrickwoodburn.com",
    "phone": "(267) - 231 - 2069",
    "website": "https://www.linkedin.com/in/patrick-woodburn-4a305363/",
    "summary": "A software engineer passionate about emerging technology that allows users to interact with the world around them.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Philadelphia",
      "countryCode": "US",
      "region": "PA"
    },
    "profiles": []
  },
  "work": [
    {
      "company": "Comcast",
      "position": "Software Engineer",
      "website": "xfinity.com",
      "startDate": "2015-03-01",
      "endDate": "2017-05-19",
      "summary": "Designing and developmenting home security and home automation systems.",
      "highlights": [
        "Operating within a team of developers to develop and test a new home automation system",
        "Working with rnternet connected devices to automate and secure user's homes.",
        "Developing android apps that could run against a users unique home automation system.",
        "Using testing tools such as junit and espresso to create test code to run against android apps for continuous integration.",
        "Building test kits to simulate devices in a normal user home.",
        "Creating technical documentation for both installers and tech support to use when assisting users.",
        "Setting up continuous integration environment using jenkins",
        "Scripting of tools to deploy to and debug on custom android firmware.",
        "Developing software to communicate over wireless interfaces such as bluetooth, wifi, and zigbee."
      ]
    },
    {
      "company": "Franklin Institute",
      "position": "Teacher",
      "website": "fi.edu",
      "startDate": "2006-04-01",
      "summary": "Teaching robotics to high school students.",
      "highlights": [
        "Planning lessons on the topics of electrical and software development.",
        "Teaching students how to program and build circuitry required for multiple applications of robotics.",
        "Working with students to build robots for various competition and museum displays.",
        "Documenting use and maintence of students projects to be handed off to groups tasked with operation through museum.",
        "Building software tools that the students can use to better debug their projects.",
        "Presenting and demonstrating robotics projects to large groups of people.",
        "Operating robots in around the museum."
      ]
    },
    {
      "company": "Independence Blue Cross",
      "position": "Software Engineer",
      "website": "ibx.com",
      "startDate": "2014-08-01",
      "endDate": "2015-02-01",
      "summary": "Writing secure access software for customers to access their person private Insurance information.",
      "highlights": [ "Implementing given designs so that users may have the most comfortable experience possible when accessing their insurance information.",
      "Creating cross platform mobile apps that could be rebranded for multiple insureance companies.",
      "Porting functionality of apps between incompatable code repositories." ] },
    {
      "company": "BioHitech America",
      "position": "Intern",
      "website": "biohitech.com",
      "startDate": "2014-01-01",
      "endDate": "2014-07-01",
      "summary": "Developing Linux-based software to run on industrial organic digester",
      "highlights": [
        "Developing software to run on headless industrial machinery and preform analytics on their use.",
        "Set up and maintained Linux devices to be used in embedded industrial applications.",
        "Creating static environment configuration for large numbers of linux machinery and virtual machines",
        "Developing Kiosk software to be be able to track metrics from items scaned with nfc chips.",
        "Developing webpages to pull from various restful APIs.",
        "Creating firmware to drive touchscreen pannels.",
        "Researching and retrofitting new hardware for industrial grade machinery"
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Code for Philly",
      "position": "",
      "website": "codeforphilly.org",
      "startDate": "2011-05-01",
      "endDate": "2016-01-01",
      "summary": "Developed Open source software for the betterment of conditions in Philadelphia",
      "highlights": [
        "Acted as a subject matter expert on developing API's and integrating them into web and mobile apps.",
        "Creating Websites for community service projects.",
        "Building apps to help transform improve communities within the city.",
        "Developing APIs to open up public data from the city.",
        "Helping others to bring up and configure their server solutions on a project to project basis.",
        "Building data scrapers to bring data into databases from other sources."
      ]
    }
  ],
  "education": [
    {
      "institution": "Harrisburg University Of Science And Technology",
      "area": "Computer Information Sciences",
      "studyType": "Bachelor",
      "startDate": "2010-09-01",
      "endDate": "2014-05-01",
      "gpa": "3.4 Major",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Software Engineering",
      "keywords": ["Java","C++","Python","Android","HTML","Object Oriented Programming","JavaScript","Nodejs", "Git", "Linux","rxJava","php","bash","jquary","React Native","Jenkins","Docker","ansible", "cloud", "embeded", "data"]
    },
    {
      "name": "Electrical Design",
      "keywords": ["Circuit Design", "Prototyping", "soldering", "CAD"]
    }
  ],
  "interests": [
    {
      "name": "Robotics",
      "keywords": ["Internet Of Things", "Electrical", "Control Systems"]
    },
    {
      "name": "Artificial Intelligence ",
      "keywords": ["AI", "Neural Networks", "Big Data"]
    },
    {
      "name": "Home Automation",
      "keywords": ["Internet Of Things", "Electrical"]
    },
    {
      "name": "Embedded Systems",
      "keywords": ["Linux", "Micro Controller", "PIC", "AVR", "Arm"]
    },
    {
        "name" :"3D printing",
        "keywords": ["CAD", "CNC", "Rapid prototyping"]
    }

  ],
  "references": []
}
