{
  "basics": {
    "name": "Patrick Woodburn",
    "picture": "./picture.jpg",
    "label": "Software Engineer",
    "email": "pat@patrickwoodburn.com",
    "phone": "(267) - 231 - 2069",
    "website": "http://www.patrickwoodburn.com",
    "summary": "A jack of all trades software engineer with over 8 year of delivering sevice and software at scale to allow users software and devices to comunicate at large scales. Passionate about emerging technologies that allow users to interact with and better understand the the world around them.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Philadelphia",
      "countryCode": "US",
      "region": "PA"
    },
    "profiles": []
  },
  "work": [
    {
      "company": "Fort Robotics",
      "Position": "Software Engineer",
      "website": "https://fortrobotics.com",
      "startDate": "2021-06-06",
      "summary": "Embedded linux software engineer for safety devices.",
      "highlights": [
        "Worked with yocto to create embedded linux distributions for custom hardware.",
        "Created standard build environments to enable developers to build consistent software.",
        "Increased performance of CMake build tools.",
        "Created chip flashing tools for low level radio interfaces.",
        "Worked on embedded communications system using zmq and coap.",
        "Set up automatic build systems for multiple code repositories in multiple programming languages.",
        "Improved code stability through the implementation of static code analysis.",
        "Trasitioned dependency management to more manageable system allowing for faster more reliable software builds.",
        "Worked on embedded hardware to increase safety in industrial environments."
      ]
    },
    {
      "company": "Thomas Jefferson University - Dice Group",
      "position": "Software Engineer",
      "website": "https://www.dicegrp.org",
      "startDate": "2017-12-21",
      "endDate": "2021-06-04",
      "summary": "Lead embedded software engineer for the Internet of Things team.",
      "highlights": [
        "Worked on software that drove the first ever HIPPA compliant smart speaker.",
        "Built APIs that allowed for internet connected devices to communicate between each other for the purpose of controlling equipment in a hospital setting.",
        "Wrote Linux scripts used to manage a suite of software focused on the embedded platform.",
        "Built a system for intercommunication between APIs and firewall protected embedded systems.",
        "Designed a system for delivering software updates leveraging MQTT events.",
        "Used Google Cloud Platform to control and maintain numerous Jefferson IoT projects.",
        "Improved data flow between existing APIs to ensure negligible delay between interconnected systems.",
        "Lead conversations on uses, pros and cons, and implementation of IoT networks including LoRaWAN, Bluetooth, WiFi, and cellular within the engineering team.",
        "Designed and created prototypes of simple electrical circuits for small batch products on experimental IoT and embedded system projects.",
        "Designed 3D printed short run rapid protype housings for early phase projects during the proof of concept stage.",
        "Created an interface for controlling Docker over the MQTT network.",
        "Maintained Docker images for testing embedded software in order to eliminate the need for physical hardware.",
        "Created workflows for using Docker on embedded systems.",
        "Created systems to automatically and dynamically deploy software to embedded hardware.",
        "Implement Redis as a low lag reliable cross application key store and communication bus solution."
      ]
    },
    {
      "company": "Comcast",
      "position": "Software Engineer",
      "website": "http://www.xfinity.com",
      "startDate": "2015-03-01",
      "endDate": "2017-05-19",
      "summary": "Designed and developed home security and home automation systems.",
      "highlights": [
        "Operated within a team of developers to develop and test a new home automation system.",
        "Worked with internet connected devices to automate and secure user's homes.",
        "Developed android apps that could run against a users unique home automation system.",
        "Used testing tools such as junit and espresso to create test code to run against android apps for continuous integration.",
        "Built test kits to simulate devices in a typical user's home.",
        "Created technical documentation for both installation technicians and tech support to use when assisting users.",
        "Set up continuous integration environment using Jenkins.",
        "Scripted tools to deploy to and debug on custom android firmware.",
        "Developed software to communicate over wireless interfaces such as bluetooth, WIFI, and Zigbee."
      ]
    },
    {
      "company": "Franklin Institute",
      "position": "Teacher",
      "website": "http://www.fi.edu",
      "startDate": "2006-04-01",
      "endDate": "2019-06-30",
      "summary": "Taught robotics to high school students.",
      "highlights": [
        "Planned lessons on the topics of electrical and software development.",
        "Taught students how to program and build circuitry required for multiple applications of robotics.",
        "Worked with students to build robots for various competition and museum displays.",
        "Documented use and maintenance of students' projects to be handed off to groups tasked with operation through museum.",
        "Built software tools that the students can use to better debug their projects.",
        "Presented and demonstrated robotics projects to large groups of people.",
        "Operated robots in and around the museum."
      ]
    },
    {
      "company": "Independence Blue Cross",
      "position": "Software Engineer",
      "website": "http://www.ibx.com",
      "startDate": "2014-08-01",
      "endDate": "2015-02-01",
      "summary": "Wrote secure access software for customers to access their person private insurance information.",
      "highlights": [
        "Implemented given designs so that users may have the most comfortable experience possible when accessing their insurance information.",
        "Created cross-platform mobile apps that could be rebranded for multiple insurance companies.",
        "Ported functionality of apps between incompatible code repositories."
      ]
    },
    {
      "company": "BioHitech America",
      "position": "Intern",
      "website": "http://www.biohitech.com",
      "startDate": "2014-01-01",
      "endDate": "2014-07-01",
      "summary": "Developed Linux-based software to run on industrial organic digester.",
      "highlights": [
        "Developed software to run on headless industrial machinery and perform analytics regarding their use.",
        "Set up and maintained Linux devices to be used in embedded industrial applications.",
        "Created static environment configuration for linux machinery and virtual machines.",
        "Developed Kiosk software to be be able to track metrics from items scanned with nfc chips.",
        "Developed webpages to pull from various RESTful APIs.",
        "Created firmware to drive touchscreen pannels.",
        "Researched and retrofitted new hardware for industrial-grade machinery."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Code for Philly",
      "position": "",
      "website": "http://www.codeforphilly.org",
      "startDate": "2011-05-01",
      "endDate": "2016-01-01",
      "summary": "Developed Open source software for the betterment of Philadelphia.",
      "highlights": [
        "Acted as a subject matter expert on developing API's and integrating them into web and mobile apps.",
        "Created websites for community service projects.",
        "Built apps to help transform improve communities within the city.",
        "Developed APIs to open up public data from the city.",
        "Helped others to bring up and configure their server solutions on a project to project basis.",
        "Built data scrapers to bring data into databases from other sources."
      ]
    }
  ],
  "education": [
    {
      "institution": "Harrisburg University Of Science And Technology",
      "area": "Computer Information Sciences",
      "studyType": "Bachelor",
      "startDate": "2010-09-01",
      "endDate": "2014-05-01",
      "gpa": "3.4 Major",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Software Engineering",
      "keywords": [
        "Java",
        "C++",
        "CMake",
        "Python",
        "Android",
        "HTML",
        "Object Oriented Programming",
        "JavaScript",
        "Nodejs",
        "Git",
        "Linux",
        "rxJava",
        "php",
        "bash",
        "jQuery",
        "React Native",
        "Jenkins",
        "Docker",
        "ansible",
        "cloud",
        "embeded",
        "data"
      ]
    },
    {
      "name": "Electrical Design",
      "keywords": ["Circuit Design", "Prototyping", "soldering", "CAD"]
    }
  ],
  "interests": [
    {
      "name": "Robotics",
      "keywords": [
        "Internet Of Things",
        "Electrical",
        "Control Systems",
        "Electrical",
        "Control Systems",
        "Embedded",
        "BLE",
        "radio",
        "microcontroller",
        "arduino",
        "PIC",
        "AVR",
        "Arm"
      ]
    },
    {
      "name": "Artificial Intelligence ",
      "keywords": ["AI", "Neural Networks", "Big Data"]
    },
    {
      "name": "Home Automation",
      "keywords": [
        "Internet Of Things",
        "Electrical",
        "Control Systems",
        "Embedded",
        "Wireless",
        "BLE",
        "mqtt",
        "Zigbee",
        "xbee",
        "ZWAVE",
        "arduino",
        "microcroller",
        "PIC",
        "AVR",
        "Arm"
      ]
    },
    {
      "name": "Embedded Systems",
      "keywords": ["Linux", "Micro Controller", "PIC", "AVR", "Arm"]
    },
    {
      "name": "3D printing",
      "keywords": ["CAD", "CNC", "Rapid prototyping"]
    }
  ],
  "references": []
}
